<?php
/**
 * 当前模块语言包
 * @author 王远庆 <[562909771@qq.com]>
 */

return [
    // 系统错误提示
    '200001'                   => '表单模板/表单模板字段名称已经存在',
    '200002'                   => '请先删除该表单下的字段信息',
    '200003'                   => '表单模板名称不能为空',
    '200004'                   => '调用标识不能为空',
    '200005'                   => '字段名称不能为空',
    '200006'                   => '字段标识不能为空',
    '200007'                   => '请先删除该表单模板下的字段信息',
    '200008'                   => '被克隆的数据不存在',
    '200009'                   => '表单模板创建失败',
    '200010'                   => '克隆失败',
    '200011'                   => '克隆成功',
    '200012'                   => '表单模板调用标识已经存在',
    '200013'                   => '调用标识格式错误',
    '200014'                   => '表单模板/表单模板字段不存在',
    '200015'                   => '表单模板字段已经存在',
];
