<?php
/**
 * 当前模块语言包
 * @author 王远庆 <[562909771@qq.com]>
 */

return [
    // 系统错误提示
    '200001'                   => '支付通道暂未开通',
    '200002'                   => '请完善配置信息',
    '200003'                   => '银行不存在',
    '200004'                   => '支付信息错误',
    '200005'                   => '提现账号异常',
    '200006'                   => '提现卡号异常',
    '200007'                   => '提现金额异常',
    '200008'                   => '代付验签失败',
    '200009'                   => '代付失败',
];
