<?php
/**
 * 当前模块语言包
 * @author 王远庆 <[562909771@qq.com]>
 */

return [
    // 系统错误提示
    '200001'                   => '请输入正确的手机号码',
    '200002'                   => '手机号已被注册',
    '200003'                   => '手机号未注册',
    '200004'                   => '短信发送类型错误',
    '200005'                   => '短息发送频率太快',
    '200006'                   => '短信发送次数已达上限',
    '200007'                   => '短信未设置签名字符串',
    '200008'                   => '未配置短信服务商',
    '200009'                   => '短信发送失败:【%s】',
    '200010'                   => '验证码类型错误',
    '200011'                   => '手机验证码错误',
];
